Tekla Open API Reference for Tekla Structures 2025
PointCloud.SetVisibility Method
 Set point cloud visibility in given views.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetVisibility(
	List<View> views,
	bool visible
)
Public Function SetVisibility (
	views As List(Of View),
	visible As Boolean
) As Boolean
Parameters
views
Type: System.Collections.Generic.List<View>
The views, in which the point clouds visibility is changed.
visible
Type: System.Boolean
Visibility value: True for visible, false for hidden.
Return Value
Type: Boolean
True if successful to all given views, otherwise false.
See Also
Reference
PointCloud Class
Tekla.Structures.Model Namespace